# Реализовать алгоритм перемешивания списка.
import random
y = ['Шла ', 'Бежала ', 'Ехала ', 'Гуляла ']
random.shuffle(y)
print(y)