# Напишите программу, удаляющую из текста все слова содержащие "абв".

lists = 'абв1абв2абв3абв4абвдор5абв6абвара7абвпа'
lists1 = lists.replace('абв','')
print(lists1)